src/InformationRegisters/Scan_Сообщения/Scan_Сообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_Сообщения</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Scan_СпециальныеУсловия</types>
      <types>CatalogRef.Scan_СоглашенияОПоставке</types>
      <types>DocumentRef.Scan_ЗаявкаНаОтгрузку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоступноДилеру</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/Scan_ТипыСоглашенийОПоставке/Scan_ТипыСоглашенийОПоставке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_ТипыСоглашенийОПоставке</name>
  <enumValues>
    <name>ЗаявкаНаСОП</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНаСОПSRU</name>
  </enumValues>
</mdclass:Enum>

src/InformationRegisters/Scan_Сообщения/ManagerModule.bsl
Функция ДобавитьСообщение(СтрокаHTML, Текстсообщения, Пользователь, ВремяСообщения) Экспорт
	//rarus vikhle 02.07.2020 mt 15888 +++
	СтрокаHTML = СтрокаHTML + "<div align=" + ?(Пользователь = ПараметрыСеанса.ТекущийПользователь,"right","left") +"> <table border=""0"" cellpadding=""0"" cellspacing=""0"" style="" width:250px"">
		|<tbody>
		|	<tr>
		|		<td style=""background-color:#" + ?(Пользователь = ПараметрыСеанса.ТекущийПользователь,"bae2b6","99e4ff") + ";border-radius:10px;padding:15px;word-break: break-all""><span style=""font-size:14px"">
		|		<p>" + ТекстСообщения + "</td>
		|</tr>" ;
		
	СтрокаHTML = СтрокаHTML + "<tr>	<td style=""text-align:" + ?(Пользователь = ПараметрыСеанса.ТекущийПользователь,"right","left")+""""" ><span style=""font-size:12px""><em>" 
	+ ВремяСообщения +" " + Пользователь  
	+ ?(ЗначениеЗаполнено(Пользователь.Сотрудник), "," + Пользователь.Сотрудник.Должность,"") +  "</em></td></tr></tbody></table></div>";
	//rarus vikhle 02.07.2020 mt 15888 ---	
	Возврат СтрокаHTML;
КонецФункции

//rarus agar 21.08.2020 16055 ++
Процедура ЗаписатьСообщение(Объект, Пользователь, ДоступноДилеру = Истина, ТекстСообщения) Экспорт
	
	НоваяЗапись = РегистрыСведений.Scan_Сообщения.СоздатьМенеджерЗаписи();
	НоваяЗапись.Период         = ТекущаяДатаСеанса();
	НоваяЗапись.Объект         = Объект;
	НоваяЗапись.Пользователь   = Пользователь;
	НоваяЗапись.ДоступноДилеру = ДоступноДилеру;
	НоваяЗапись.ТекстСообщения = СокрЛП(ТекстСообщения);
	
	Попытка
		НоваяЗапись.Записать();
	Исключение КонецПопытки;
	
КонецПроцедуры
//rarus agar 21.08.2020 16055 --

Функция СообщенияСвязанныхЗаявок(ЗаявкаСсылка) Экспорт //rarus vikhle 05.10.2021 mt 18076 +++ 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сообщения.Объект КАК Объект,
		|	Сообщения.Пользователь КАК Пользователь,
		|	Сообщения.ДоступноДилеру КАК ДоступноДилеру,
		|	Сообщения.ТекстСообщения КАК ТекстСообщения,
		|	Сообщения.Период КАК Период
		|ИЗ
		|	РегистрСведений.Scan_Сообщения КАК Сообщения
		|ГДЕ
		|	Сообщения.Объект В(&СвязанныеОбъекты)
		|	И НЕ Сообщения.Объект.ТипСоглашенияОПоставке = ЗНАЧЕНИЕ(Перечисление.Scan_ТипыСоглашенийОПоставке.ЗаявкаНаСОПSRU)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
	
	СвязанныеОбъекты = Scan_ВспомогательныеФункцииСервер.ПолучитьСтруктуруПодчиненности(ЗаявкаСсылка, "Основание", Истина);
	Запрос.УстановитьПараметр("СвязанныеОбъекты", СвязанныеОбъекты);
	ТЗСообщений = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗСообщений;
	
КонецФункции //rarus vikhle 05.10.2021 mt 18076 ---	

Функция СообщенияОбъекта(Объект) Экспорт //rarus vikhle 05.10.2021 mt 18076 +++
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сообщения.Объект КАК Объект,
		|	Сообщения.Пользователь КАК Пользователь,
		|	Сообщения.ДоступноДилеру КАК ДоступноДилеру,
		|	Сообщения.ТекстСообщения КАК ТекстСообщения,
		|	Сообщения.Период КАК Период
		|ИЗ
		|	РегистрСведений.Scan_Сообщения КАК Сообщения
		|ГДЕ
		|	Сообщения.Объект = &Объект
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("Объект", Объект);
	ТЗСообщений = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗСообщений;
	
КонецФункции //rarus vikhle 05.10.2021 mt 18076 ---	

Процедура СкопироватьСообщения(Объект, ИсходныйОбъект = Неопределено, ТаблицаСообщений = Неопределено) Экспорт //rarus vikhle 05.10.2021 mt 18076 ---
	
	Если ИсходныйОбъект = Неопределено И ТаблицаСообщений = Неопределено Тогда
		ТаблицаСообщений = СообщенияСвязанныхЗаявок(Объект);
	ИначеЕсли НЕ ИсходныйОбъект = Неопределено И ТаблицаСообщений = Неопределено Тогда
		ТаблицаСообщений = СообщенияОбъекта(ИсходныйОбъект);
	КонецЕсли;	
	
	Для Каждого СтрокаТЗ Из ТаблицаСообщений Цикл
		МенеджерЗаписи = РегистрыСведений.Scan_Сообщения.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтрокаТЗ,, "Объект");
		МенеджерЗаписи.Объект = Объект;
		МенеджерЗаписи.Записать();
	КонецЦикла;	
	
КонецПроцедуры //rarus vikhle 05.10.2021 mt 18076 ---
